#include <iostream>
using namespace std;
 int main() {
	//If9. Даны две переменные вещественного типа: A, B. Перераспределить значения данных переменных так, чтобы в A оказалось меньшее из значений,
	//а в B — большее.Вывести новые значения переменных A и B.
		//double a, b;
		//in >> a >> b;
		//if (a > b) {
		//	double t = a;
		//	a = b;
		//	b = t;
		//}
		//cout << a << " " << b << endl;

		//12 задача 
	//int a, b, c;
	//cin >> a >> b >> c;
	//if (a < b && a < c) {
	//	cout << a;
	//}

	//else if (b < a && b < c) {
	//	cout << b;
	//}
	//else if (c < a && c < b) {
	//	cout << c;
	//}
	//If24. Для данного вещественного x найти значение следующей функции f,
	//принимающей вещественные значения :
	//f(x) = 2·sin(x), если x > 0,
	//	6 − x, если x ≤ 0
	//double f;
	//double x;
	//cin >> x;
	//if (x > 0) f = 2 * sin(x);
	//else f = 6 - x;
	//	cout << "f(x) = " << f << endl;












}